Config/InformationRegisters/ФайлыСотрудниковКДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФайлыСотрудниковКДокументам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФайлСотрудника</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСФайламиСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ФайлыСотрудниковКДокументам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Документ)
	|;
    |РазрешитьИзменениеЕслиРазрешеноЧтение
    |ГДЕ 
	|	ЗначениеРазрешено(Документ)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Записать файл сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
//  Файл - ОпределяемыйТип.ПрисоединенныйФайл
Процедура ЗаписатьФайлСотрудника(Документ, Сотрудник, Файл) Экспорт

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ФайлыСотрудниковКДокументам");
		ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
		ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
		Блокировка.Заблокировать();
		
		ФайлыСотрудников = СоздатьНаборЗаписей();
		ФайлыСотрудников.Отбор.Документ.Установить(Документ);
		ФайлыСотрудников.Отбор.Сотрудник.Установить(Сотрудник);
		НовыйФайл = ФайлыСотрудников.Добавить();
		НовыйФайл.Документ = Документ;
		НовыйФайл.Сотрудник = Сотрудник;
		НовыйФайл.ФайлСотрудника = Файл;
		
		ФайлыСотрудников.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

// Удалить файл сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
Процедура УдалитьФайлСотрудника(Документ, Сотрудник) Экспорт

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ФайлыСотрудниковКДокументам");
		ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
		ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
		Блокировка.Заблокировать();
		
		ФайлыСотрудников = СоздатьНаборЗаписей();
		ФайлыСотрудников.Отбор.Документ.Установить(Документ);
		ФайлыСотрудников.Отбор.Сотрудник.Установить(Сотрудник);
		ФайлыСотрудников.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

// Файлы сотрудников.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
// 
// Возвращаемое значение:
//  Соответствие из ОпределяемыйТип.ПрисоединенныйФайл - Файлы сотрудников
Функция ФайлыСотрудников(Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФайлыСотрудниковКДокументам.Сотрудник,
	|	ФайлыСотрудниковКДокументам.ФайлСотрудника
	|ИЗ
	|	РегистрСведений.ФайлыСотрудниковКДокументам КАК ФайлыСотрудниковКДокументам
	|ГДЕ
	|	ФайлыСотрудниковКДокументам.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Новый Соответствие;

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ФайлыСотрудниковКДокументам");
		ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Блокировка.Заблокировать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Сотрудник, Выборка.ФайлСотрудника);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

// Файл сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  ОпределяемыйТип.ПрисоединенныйФайл, Неопределено - Файл сотрудника
Функция ФайлСотрудника(Документ, Сотрудник) Экспорт
	Возврат ФайлыСотрудников(Документ).Получить(Сотрудник);
КонецФункции

#КонецОбласти

#КонецЕсли
